Documents/Ар_УстановкаПлощади.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Ар_УстановкаПлощади</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Ар_ПлощадиОбъектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Ар_ПлощадиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Ар_ПлощадиОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Ар_УстановкаПлощади/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоИК(Команда)
	
	Если Объект.Помещения.Количество() > 0 Тогда
		
		ТекстВопроса = "Табличные части: ""Помещения"" будут очищены и заполнены заново!";
		ПараметрыВопроса = Новый Структура("Заполнить", Истина);
		Оповещение = Новый ОписаниеОповещения("ЗапросНаПерезаполнение", ЭтаФорма, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
	Иначе
		
		Объект.Помещения.Очистить();
		ЗаполнитьПомещения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаПерезаполнение(Знач Результат, ПараметрыВопроса) Экспорт
	
	Если ПараметрыВопроса.Свойство("Заполнить") И ПараметрыВопроса.Заполнить И Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Помещения.Очистить();
		ЗаполнитьПомещения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПомещения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спр.Ссылка КАК Объект,
	               |	ЕСТЬNULL(Рег.Площадь, 0) КАК Площадь
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК Спр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ар_ПлощадиОбъектов.СрезПоследних(&Период, ) КАК Рег
	               |		ПО Спр.Ссылка = Рег.Объект
	               |ГДЕ
	               |	Спр.Ссылка В ИЕРАРХИИ(&ИК)";
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	Объект.Помещения.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
